/*
 Localized strings for CFErrors returned by AVFoundationCF.

 When displayed in an alert, the strings whose keys end in _Description will be the alert title.
 The strings whose keys end in _RecoverySuggestion or _FailureReason will be the alert body.
 */

"AVFoundationCFErrorDomain_AVCFErrorOutOfMemory_Description" = "Não foi possível completar a ação";
"AVFoundationCFErrorDomain_AVCFErrorOutOfMemory_RecoverySuggestion" = "Volte a tentar mais tarde.";

"AVFoundationCFErrorDomain_AVCFErrorFileFormatNotRecognized_Description" = "Não foi possível abrir";
"AVFoundationCFErrorDomain_AVCFErrorFileFormatNotRecognized_FailureReason" = "Este formato multimédia não é suportado.";
"AVFoundationCFErrorDomain_AVCFErrorFileFailedToParse_Description" = "Não foi possível abrir";
"AVFoundationCFErrorDomain_AVCFErrorFileFailedToParse_FailureReason" = "É possível que este conteúdo esteja danificado.";

"AVFoundationCFErrorDomain_AVCFErrorContentIsProtected_Description" = "Não foi possível abrir";
"AVFoundationCFErrorDomain_AVCFErrorContentIsProtected_FailureReason" = "Esta aplicação não está autorizada a reproduzir este ficheiro."; /* the file is DRM protected */
"AVFoundationCFErrorDomain_AVCFErrorNoImageAtTime_Description" = "Não foi possível abrir";
"AVFoundationCFErrorDomain_AVCFErrorNoImageAtTime_FailureReason" = "Não é possível usar este conteúdo multimédia.";
"AVFoundationCFErrorDomain_AVCFErrorDecoderTemporarilyUnavailable_Description" = "Não é possível descodificar";
"AVFoundationCFErrorDomain_AVCFErrorDecoderTemporarilyUnavailable_FailureReason" = "O descodificador necessário está ocupado.";
"AVFoundationCFErrorDomain_AVCFErrorDecoderTemporarilyUnavailable_RecoverySuggestion" = "Pare ações que descodificam conteúdos e volte a tentar.";
"AVFoundationCFErrorDomain_AVCFErrorIncompatibleAsset_Description" = "Não foi possível abrir";
"AVFoundationCFErrorDomain_AVCFErrorIncompatibleAsset_FailureReason" = "Não é possível usar o conteúdo multimédia neste computador.";
"AVFoundationCFErrorDomain_AVCFErrorNoCompatibleAlternatesForExternalDisplay_Description" = "Não é possível abrir";
"AVFoundationCFErrorDomain_AVCFErrorNoCompatibleAlternatesForExternalDisplay_FailureReason" = "Não é possível reproduzir o conteúdo no monitor externo.";
"AVFoundationCFErrorDomain_AVCFErrorInsufficientContentProtectionConfiguration_Description" = "Não é possível abrir";
"AVFoundationCFErrorDomain_AVCFErrorInsufficientContentProtectionConfiguration_FailureReason" = "O conteúdo protegido não pode ser reproduzido na configuração atual do sistema.";
"AVFoundationCFErrorDomain_AVCFErrorTranscodeFrameMismatch_Description" = "A faixa de vídeo de saída da transcodificação tem uma contagem de fotogramas incorreta";
"AVFoundationCFErrorDomain_AVCFErrorTranscodeFrameMismatch_FailureReason" = "A contagem de fotogramas de saída da transcodificação não é igual à origem, que não tem segmentos de edição";
"AVFoundationCFErrorDomain_AVCFErrorDecodeFailed_Description" = "Falha ao descodificar";
"AVFoundationCFErrorDomain_AVCFErrorDecodeFailed_FailureReason" = "o descodificador detetou um erro";
"AVFoundationCFErrorDomain_AVCFErrorEncodeFailed_Description" = "Falha ao codificar";
"AVFoundationCFErrorDomain_AVCFErrorEncodeFailed_FailureReason" = "o codificador detetou um erro";
"AVFoundationCFErrorDomain_AVCFErrorInvalidPersistentKey_Description" = "A chave offline fornecida não é válida";
"AVFoundationCFErrorDomain_AVCFErrorInvalidPersistentKey_FailureReason" = "A chave offline fornecida pode não ser válida ou o diretório de armazenamento de chaves persistentes não foi encontrado.";
"AVFoundationCFErrorDomain_AVCFErrorContentIsNotAuthorized_Description" = "Não foi possível abrir";
"AVFoundationCFErrorDomain_AVCFErrorContentIsNotAuthorized_FailureReason" = "Este computador não está autorizado a reproduzir o conteúdo.";
"AVFoundationCFErrorDomain_AVCFErrorApplicationIsNotAuthorized_Description" = "Não foi possível abrir";
"AVFoundationCFErrorDomain_AVCFErrorApplicationIsNotAuthorized_FailureReason" = "Esta aplicação não está autorizada a reproduzir conteúdos protegidos.";
"AVFoundationCFErrorDomain_AVCFErrorContentIsUnavailable_Description" = "Não foi possível abrir";
"AVFoundationCFErrorDomain_AVCFErrorContentIsUnavailable_FailureReason" = "Este conteúdo já não está disponível.";
